"Please Donate" = "தயவுசெய்து நன்கொடை செய்யுங்கள்";
"Donate" = "நன்கொடை";
"This is free software, but it still costs money to write, support, and distribute it. If you enjoy using it, please consider a donation to the authors of this software. It will help to make Cyberduck even better!" = "இது இலவச மென்பொருள், ஆனால் அதை எழுதவும், ஆதரிக்கவும், விநியோகிக்கவும் பணம் செலவாகும். இதைப் பயன்படுத்துவதை நீங்கள் மகிழ்கிறீர்கள் என்றால், தயவுசெய்து இந்த மென்பொருளின் ஆசிரியர்களுக்கு நன்கொடை செய்யுங்கள். இணையவாத்தை இன்னும் சிறப்பாக மாற்ற இது உதவும்!";
"As a contributor to Cyberduck, you receive a registration key that disables this prompt." = "இணையவாத்திற்கு பங்களிப்பாளராக, இந்தக் கேள்வியை முடக்கும் பதிவு திறவுகோலை நீங்கள் பெறுவீர்கள்.";
"Thank you for using Cyberduck!" = "இணையவாத்து பயன்படுத்தியதற்கு நன்றி!";
"Later" = "பின்னர்";
"Don't show again for this version" = "இந்தப் பதிப்பிற்கு மீண்டும் காட்ட வேண்டாம்";
"Registration Key" = "பதிவு திறவுகோல்";

"Buy in Windows Store" = "சாளரங்கள் கடையில் வாங்கவும்";
"Buy in Mac App Store" = "மேக் பயன் கடையில் வாங்கவும்";
